MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB412/mcu.h
#define _SPI2IMSKL_SPITBFEN_POSITION             0x00000001
#define _SPI2IMSKL_SPITBFEN_MASK                 0x00000002
#define _SPI2IMSKL_SPITBFEN_LENGTH               0x00000001

#define _SPI2IMSKL_SPITBEN_POSITION              0x00000003
#define _SPI2IMSKL_SPITBEN_MASK                  0x00000008
#define _SPI2IMSKL_SPITBEN_LENGTH                0x00000001

#define _SPI2IMSKL_SPIRBEN_POSITION              0x00000005
#define _SPI2IMSKL_SPIRBEN_MASK                  0x00000020
#define _SPI2IMSKL_SPIRBEN_LENGTH                0x00000001

#define _SPI2IMSKL_SPIROVEN_POSITION             0x00000006
#define _SPI2IMSKL_SPIROVEN_MASK                 0x00000040
#define _SPI2IMSKL_SPIROVEN_LENGTH               0x00000001

#define _SPI2IMSKL_SRMTEN_POSITION               0x00000007
#define _SPI2IMSKL_SRMTEN_MASK                   0x00000080
#define _SPI2IMSKL_SRMTEN_LENGTH                 0x00000001

#define _SPI2IMSKL_SPITUREN_POSITION             0x00000008
#define _SPI2IMSKL_SPITUREN_MASK                 0x00000100
#define _SPI2IMSKL_SPITUREN_LENGTH               0x00000001

#define _SPI2IMSKL_BUSYEN_POSITION               0x0000000B
#define _SPI2IMSKL_BUSYEN_MASK                   0x00000800
#define _SPI2IMSKL_BUSYEN_LENGTH                 0x00000001

#define _SPI2IMSKL_FRMERREN_POSITION             0x0000000C
#define _SPI2IMSKL_FRMERREN_MASK                 0x00001000
#define _SPI2IMSKL_FRMERREN_LENGTH               0x00000001

#define _SPI2IMSK2_TXMSK_POSITION                0x00000000
#define _SPI2IMSK2_TXMSK_MASK                    0x0000003F
#define _SPI2IMSK2_TXMSK_LENGTH                  0x00000006

#define _SPI2IMSK2_TXWIEN_POSITION               0x00000007
#define _SPI2IMSK2_TXWIEN_MASK                   0x00000080
#define _SPI2IMSK2_TXWIEN_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK_POSITION                0x00000008
#define _SPI2IMSK2_RXMSK_MASK                    0x00003F00
#define _SPI2IMSK2_RXMSK_LENGTH                  0x00000006

#define _SPI2IMSK2_RXWIEN_POSITION               0x0000000F
#define _SPI2IMSK2_RXWIEN_MASK                   0x00008000
#define _SPI2IMSK2_RXWIEN_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK0_POSITION               0x00000000
#define _SPI2IMSK2_TXMSK0_MASK                   0x00000001
#define _SPI2IMSK2_TXMSK0_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK1_POSITION               0x00000001
#define _SPI2IMSK2_TXMSK1_MASK                   0x00000002
#define _SPI2IMSK2_TXMSK1_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK2_POSITION               0x00000002
#define _SPI2IMSK2_TXMSK2_MASK                   0x00000004
#define _SPI2IMSK2_TXMSK2_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK3_POSITION               0x00000003
#define _SPI2IMSK2_TXMSK3_MASK                   0x00000008
#define _SPI2IMSK2_TXMSK3_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK4_POSITION               0x00000004
#define _SPI2IMSK2_TXMSK4_MASK                   0x00000010
#define _SPI2IMSK2_TXMSK4_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK5_POSITION               0x00000005
#define _SPI2IMSK2_TXMSK5_MASK                   0x00000020
#define _SPI2IMSK2_TXMSK5_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK0_POSITION               0x00000008
#define _SPI2IMSK2_RXMSK0_MASK                   0x00000100
#define _SPI2IMSK2_RXMSK0_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK1_POSITION               0x00000009
#define _SPI2IMSK2_RXMSK1_MASK                   0x00000200
#define _SPI2IMSK2_RXMSK1_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK2_POSITION               0x0000000A
#define _SPI2IMSK2_RXMSK2_MASK                   0x00000400
#define _SPI2IMSK2_RXMSK2_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK3_POSITION               0x0000000B
#define _SPI2IMSK2_RXMSK3_MASK                   0x00000800
#define _SPI2IMSK2_RXMSK3_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK4_POSITION               0x0000000C
#define _SPI2IMSK2_RXMSK4_MASK                   0x00001000
#define _SPI2IMSK2_RXMSK4_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK5_POSITION               0x0000000D
#define _SPI2IMSK2_RXMSK5_MASK                   0x00002000
#define _SPI2IMSK2_RXMSK5_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK_POSITION                0x00000000
#define _SPI2IMSKH_TXMSK_MASK                    0x0000003F
#define _SPI2IMSKH_TXMSK_LENGTH                  0x00000006

#define _SPI2IMSKH_TXWIEN_POSITION               0x00000007
#define _SPI2IMSKH_TXWIEN_MASK                   0x00000080
#define _SPI2IMSKH_TXWIEN_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK_POSITION                0x00000008
#define _SPI2IMSKH_RXMSK_MASK                    0x00003F00
#define _SPI2IMSKH_RXMSK_LENGTH                  0x00000006

#define _SPI2IMSKH_RXWIEN_POSITION               0x0000000F
#define _SPI2IMSKH_RXWIEN_MASK                   0x00008000
#define _SPI2IMSKH_RXWIEN_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK0_POSITION               0x00000000
#define _SPI2IMSKH_TXMSK0_MASK                   0x00000001
#define _SPI2IMSKH_TXMSK0_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK1_POSITION               0x00000001
#define _SPI2IMSKH_TXMSK1_MASK                   0x00000002
#define _SPI2IMSKH_TXMSK1_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK2_POSITION               0x00000002
#define _SPI2IMSKH_TXMSK2_MASK                   0x00000004
#define _SPI2IMSKH_TXMSK2_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK3_POSITION               0x00000003
#define _SPI2IMSKH_TXMSK3_MASK                   0x00000008
#define _SPI2IMSKH_TXMSK3_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK4_POSITION               0x00000004
#define _SPI2IMSKH_TXMSK4_MASK                   0x00000010
#define _SPI2IMSKH_TXMSK4_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK5_POSITION               0x00000005
#define _SPI2IMSKH_TXMSK5_MASK                   0x00000020
#define _SPI2IMSKH_TXMSK5_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK0_POSITION               0x00000008
#define _SPI2IMSKH_RXMSK0_MASK                   0x00000100
#define _SPI2IMSKH_RXMSK0_LENGTH                 0x00000001

