MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB412/mcu.h
#define _CNPUF_CNPUF7_POSITION                   0x00000007
#define _CNPUF_CNPUF7_MASK                       0x00000080
#define _CNPUF_CNPUF7_LENGTH                     0x00000001

#define _CNPUF_CNPUF8_POSITION                   0x00000008
#define _CNPUF_CNPUF8_MASK                       0x00000100
#define _CNPUF_CNPUF8_LENGTH                     0x00000001

#define _CNPUF_CNPUF12_POSITION                  0x0000000C
#define _CNPUF_CNPUF12_MASK                      0x00001000
#define _CNPUF_CNPUF12_LENGTH                    0x00000001

#define _CNPUF_CNPUF13_POSITION                  0x0000000D
#define _CNPUF_CNPUF13_MASK                      0x00002000
#define _CNPUF_CNPUF13_LENGTH                    0x00000001

#define _IOCPUF_IOCPF0_POSITION                  0x00000000
#define _IOCPUF_IOCPF0_MASK                      0x00000001
#define _IOCPUF_IOCPF0_LENGTH                    0x00000001

#define _IOCPUF_IOCPF1_POSITION                  0x00000001
#define _IOCPUF_IOCPF1_MASK                      0x00000002
#define _IOCPUF_IOCPF1_LENGTH                    0x00000001

#define _IOCPUF_IOCPF2_POSITION                  0x00000002
#define _IOCPUF_IOCPF2_MASK                      0x00000004
#define _IOCPUF_IOCPF2_LENGTH                    0x00000001

#define _IOCPUF_IOCPF3_POSITION                  0x00000003
#define _IOCPUF_IOCPF3_MASK                      0x00000008
#define _IOCPUF_IOCPF3_LENGTH                    0x00000001

#define _IOCPUF_IOCPF4_POSITION                  0x00000004
#define _IOCPUF_IOCPF4_MASK                      0x00000010
#define _IOCPUF_IOCPF4_LENGTH                    0x00000001

#define _IOCPUF_IOCPF5_POSITION                  0x00000005
#define _IOCPUF_IOCPF5_MASK                      0x00000020
#define _IOCPUF_IOCPF5_LENGTH                    0x00000001

#define _IOCPUF_IOCPF6_POSITION                  0x00000006
#define _IOCPUF_IOCPF6_MASK                      0x00000040
#define _IOCPUF_IOCPF6_LENGTH                    0x00000001

#define _IOCPUF_IOCPF7_POSITION                  0x00000007
#define _IOCPUF_IOCPF7_MASK                      0x00000080
#define _IOCPUF_IOCPF7_LENGTH                    0x00000001

#define _IOCPUF_IOCPF8_POSITION                  0x00000008
#define _IOCPUF_IOCPF8_MASK                      0x00000100
#define _IOCPUF_IOCPF8_LENGTH                    0x00000001

#define _IOCPUF_IOCPF12_POSITION                 0x0000000C
#define _IOCPUF_IOCPF12_MASK                     0x00001000
#define _IOCPUF_IOCPF12_LENGTH                   0x00000001

#define _IOCPUF_IOCPF13_POSITION                 0x0000000D
#define _IOCPUF_IOCPF13_MASK                     0x00002000
#define _IOCPUF_IOCPF13_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF0_POSITION                 0x00000000
#define _IOCPUF_IOCPUF0_MASK                     0x00000001
#define _IOCPUF_IOCPUF0_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF1_POSITION                 0x00000001
#define _IOCPUF_IOCPUF1_MASK                     0x00000002
#define _IOCPUF_IOCPUF1_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF2_POSITION                 0x00000002
#define _IOCPUF_IOCPUF2_MASK                     0x00000004
#define _IOCPUF_IOCPUF2_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF3_POSITION                 0x00000003
#define _IOCPUF_IOCPUF3_MASK                     0x00000008
#define _IOCPUF_IOCPUF3_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF4_POSITION                 0x00000004
#define _IOCPUF_IOCPUF4_MASK                     0x00000010
#define _IOCPUF_IOCPUF4_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF5_POSITION                 0x00000005
#define _IOCPUF_IOCPUF5_MASK                     0x00000020
#define _IOCPUF_IOCPUF5_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF6_POSITION                 0x00000006
#define _IOCPUF_IOCPUF6_MASK                     0x00000040
#define _IOCPUF_IOCPUF6_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF7_POSITION                 0x00000007
#define _IOCPUF_IOCPUF7_MASK                     0x00000080
#define _IOCPUF_IOCPUF7_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF8_POSITION                 0x00000008
#define _IOCPUF_IOCPUF8_MASK                     0x00000100
#define _IOCPUF_IOCPUF8_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF12_POSITION                0x0000000C
#define _IOCPUF_IOCPUF12_MASK                    0x00001000
#define _IOCPUF_IOCPUF12_LENGTH                  0x00000001

#define _IOCPUF_IOCPUF13_POSITION                0x0000000D
#define _IOCPUF_IOCPUF13_MASK                    0x00002000
#define _IOCPUF_IOCPUF13_LENGTH                  0x00000001

#define _IOCPUF_CNPUF0_POSITION                  0x00000000
#define _IOCPUF_CNPUF0_MASK                      0x00000001
#define _IOCPUF_CNPUF0_LENGTH                    0x00000001

#define _IOCPUF_CNPUF1_POSITION                  0x00000001
#define _IOCPUF_CNPUF1_MASK                      0x00000002
#define _IOCPUF_CNPUF1_LENGTH                    0x00000001

#define _IOCPUF_CNPUF2_POSITION                  0x00000002
#define _IOCPUF_CNPUF2_MASK                      0x00000004
#define _IOCPUF_CNPUF2_LENGTH                    0x00000001

#define _IOCPUF_CNPUF3_POSITION                  0x00000003
#define _IOCPUF_CNPUF3_MASK                      0x00000008
#define _IOCPUF_CNPUF3_LENGTH                    0x00000001

#define _IOCPUF_CNPUF4_POSITION                  0x00000004
#define _IOCPUF_CNPUF4_MASK                      0x00000010
#define _IOCPUF_CNPUF4_LENGTH                    0x00000001

#define _IOCPUF_CNPUF5_POSITION                  0x00000005
#define _IOCPUF_CNPUF5_MASK                      0x00000020
#define _IOCPUF_CNPUF5_LENGTH                    0x00000001

#define _IOCPUF_CNPUF6_POSITION                  0x00000006
#define _IOCPUF_CNPUF6_MASK                      0x00000040
#define _IOCPUF_CNPUF6_LENGTH                    0x00000001

#define _IOCPUF_CNPUF7_POSITION                  0x00000007
#define _IOCPUF_CNPUF7_MASK                      0x00000080
#define _IOCPUF_CNPUF7_LENGTH                    0x00000001

#define _IOCPUF_CNPUF8_POSITION                  0x00000008
#define _IOCPUF_CNPUF8_MASK                      0x00000100
#define _IOCPUF_CNPUF8_LENGTH                    0x00000001

#define _IOCPUF_CNPUF12_POSITION                 0x0000000C
#define _IOCPUF_CNPUF12_MASK                     0x00001000
#define _IOCPUF_CNPUF12_LENGTH                   0x00000001

#define _IOCPUF_CNPUF13_POSITION                 0x0000000D
#define _IOCPUF_CNPUF13_MASK                     0x00002000
#define _IOCPUF_CNPUF13_LENGTH                   0x00000001

#define _CNPDF_IOCPDF0_POSITION                  0x00000000
#define _CNPDF_IOCPDF0_MASK                      0x00000001
#define _CNPDF_IOCPDF0_LENGTH                    0x00000001

#define _CNPDF_IOCPDF1_POSITION                  0x00000001
#define _CNPDF_IOCPDF1_MASK                      0x00000002
#define _CNPDF_IOCPDF1_LENGTH                    0x00000001

